<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"db975e4cd8e78ddf5afd3c54054fb85bcf698d97c93a28a69665667145b1a7ec","plan_job_ref":"Job Test plan target and replace #376 at https://github.com/dflook/terraform-github-actions/actions/runs/7140134586","plan_hash":"a5f2a0b4338e13f45d52f132baf2b92119c4162c10babbc295276337c97bf72d","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "XFcmeIL3cL" -> (known after apply)
  ~ foreach = "FclV4hVBgq" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #376](https://github.com/dflook/terraform-github-actions/actions/runs/7140134586)